Tekla Open API Reference for Tekla Structures 2025
RebarLegSurfaceObject.RebarSet Property
 Gets or sets the RebarSet to which the leg surface object belongs.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSet RebarSet { get; set; }
Public Property RebarSet As RebarSet
	Get
	Set
Property Value
Type: RebarSet
See Also
Reference
RebarLegSurfaceObject Class
Tekla.Structures.Model Namespace